OttoDIY/blockly/compilation/arduino/packages/arduino/tools/CMSIS-Atmel/1.2.0/CMSIS/Device/ATMEL/sam4n/include/component/tc.h
#define TC_RCR2_RXCTR_Msk (0xffffu << TC_RCR2_RXCTR_Pos) /**< \brief (TC_RCR2) Receive Counter Register */
#define TC_RCR2_RXCTR(value) ((TC_RCR2_RXCTR_Msk & ((value) << TC_RCR2_RXCTR_Pos)))
/* -------- TC_RNPR2 : (TC Offset: 0x190) Receive Next Pointer Register (pdc = 2) -------- */
#define TC_RNPR2_RXNPTR_Pos 0
#define TC_RNPR2_RXNPTR_Msk (0xffffffffu << TC_RNPR2_RXNPTR_Pos) /**< \brief (TC_RNPR2) Receive Next Pointer */
#define TC_RNPR2_RXNPTR(value) ((TC_RNPR2_RXNPTR_Msk & ((value) << TC_RNPR2_RXNPTR_Pos)))
/* -------- TC_RNCR2 : (TC Offset: 0x194) Receive Next Counter Register (pdc = 2) -------- */
#define TC_RNCR2_RXNCTR_Pos 0
#define TC_RNCR2_RXNCTR_Msk (0xffffu << TC_RNCR2_RXNCTR_Pos) /**< \brief (TC_RNCR2) Receive Next Counter */
#define TC_RNCR2_RXNCTR(value) ((TC_RNCR2_RXNCTR_Msk & ((value) << TC_RNCR2_RXNCTR_Pos)))
/* -------- TC_PTCR2 : (TC Offset: 0x1A0) Transfer Control Register (pdc = 2) -------- */
#define TC_PTCR2_RXTEN (0x1u << 0) /**< \brief (TC_PTCR2) Receiver Transfer Enable */
#define TC_PTCR2_RXTDIS (0x1u << 1) /**< \brief (TC_PTCR2) Receiver Transfer Disable */
#define TC_PTCR2_TXTEN (0x1u << 8) /**< \brief (TC_PTCR2) Transmitter Transfer Enable */
#define TC_PTCR2_TXTDIS (0x1u << 9) /**< \brief (TC_PTCR2) Transmitter Transfer Disable */
/* -------- TC_PTSR2 : (TC Offset: 0x1A4) Transfer Status Register (pdc = 2) -------- */
#define TC_PTSR2_RXTEN (0x1u << 0) /**< \brief (TC_PTSR2) Receiver Transfer Enable */
#define TC_PTSR2_TXTEN (0x1u << 8) /**< \brief (TC_PTSR2) Transmitter Transfer Enable */

/*@}*/


#endif /* _SAM4N_TC_COMPONENT_ */
